
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//@skip-check module-unused-method
&НаКлиенте
Процедура ТП1_ПриИзмененииСогласованнаяСкидка(Элемент)
	
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавлена процедура "При изменении" 
	
	Если ЗначениеЗаполнено(Объект.Товары) = Ложь И ЗначениеЗаполнено(Объект.Услуги)= Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТП1_ПересчитатьСуммуПриИзменииСкидки();
	
    //Конец доработки
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТП1_ПересчитатьСуммуПриИзменииСкидки();

	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавлена процедура "При изменении" 
	Обещание = ВопросАсинх(НСтр("ru='Изменен процент скидки. Пересчитать таблицу товаров и услуг?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Результат = Ждать обещание; 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ТП1_КомандаПересчитатьТаблицу()
				
	КонецЕсли;
	
	//Конец доработки
	
КонецПроцедуры 

&НаКлиенте
Процедура ТП1_КомандаПересчитатьТаблицу()
		
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавлена процедура выпонения команды
	
	Для Каждого СтрокаТовар Из Объект.Товары Цикл
		
		РассчитатьСуммуСтроки(СтрокаТовар);
		
	КонецЦикла; 
	
	Для Каждого СтрокаУслуга Из Объект.Услуги Цикл
		
		РассчитатьСуммуСтроки(СтрокаУслуга);
		
	КонецЦикла;

    //Конец доработки
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавлен новый код пересчета суммы по строке:
	СуммаВсехСкидок = ТекущиеДанные.Скидка + Объект.ТП1_СогласованнаяСкидка; 
	КоэффициентВсехСкидок = 1 - СуммаВсехСкидок / 100;
	
    Если СуммаВсехСкидок > 100 Тогда
		ТекущиеДанные.Сумма = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Итоговая скидка по позиции %1 ""%2"" больше 100!", ТекущиеДанные.НомерСтроки,ТекущиеДанные.Номенклатура);
		Сообщение.Сообщить();	
	Иначе
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена * КоэффициентВсехСкидок;	
	КонецЕсли;
	
	РассчитатьСуммуДокумента();
	//Конец доработки

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
