#Область СлужебныйПрограммныйИнтерфейс
Процедура ДополнитьФорму(Форма)Экспорт
	
	//НачалоДоработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление поля реквизита формы "Контактное лицо"
	//Добавление группы "ГруппаСкидкаКоманда" на форму документа "ЗаказПокупателя"
	//Добавление поля реквизита Формы "Согласованная скидка" на форму документа "Заказ покупателя" 
	//Добавление кнопки "Пересчитать таблицу" на форму документа "Заказ покупателя"
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
		ДобавитьГруппаСкидкаКоманда(Форма);
		ДобавитьПолеВводаСогласованнаяСкидка(Форма); 
		ДобавитьКнопкуПересчитатьТаблицу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли  ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
		
	//КонецДоработки



КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)Экспорт
	
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление поля "Контактное лицо" в "ГруппаШапкаПраво"

	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаКолонкиШапки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТП1_КонтактноеЛицо";
	//Конец доработки
	
КонецПроцедуры 


Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)Экспорт
	
	//НачалоДоработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление поля "Контактное лицо" перед полем реквизита "Сумма документа"

	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, Форма.Элементы.СуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТП1_КонтактноеЛицо";
	
	//КонецДоработки
	
КонецПроцедуры

Процедура ДобавитьГруппаСкидкаКоманда(Форма)
	
	 //НачалоДоработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление группы "ГруппаСкидкаКоманда" на форму документа "Заказ покупателя"  

	Группа = Форма.Элементы.Добавить("ГруппаСкидкаКоманда", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	//КонецДоработки

КонецПроцедуры 

Процедура ДобавитьПолеВводаСогласованнаяСкидка(Форма)
	
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление поля "Согласованная скидка" в "ГруппаСкидкаКоманда" 
	
	ПолеВвода = Форма.Элементы.Добавить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидкаКоманда);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ТП1_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ТП1_ПриИзмененииСогласованнаяСкидка");
	
	//Конец доработки
КонецПроцедуры 

Процедура ДобавитьКнопкуПересчитатьТаблицу(Форма)
	
	//Начало доработки
	//**Добавлен:24.06.26. Выполнил: Егорова М.С.
	//Добавление кнопки "Пересчитать таблицу" в "ГруппаСкидкаКоманда" 
		
	Команда = Форма.Команды.Добавить("ТП1_ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "ТП1_КомандаПересчитатьТаблицу";
		
	КнопкаФормы = Форма.Элементы.Добавить("КнопкаПоказатьПредупреждение", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидкаКоманда); 
	КнопкаФормы.ИмяКоманды = "ТП1_ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	//Конец доработки

	
КонецПроцедуры
#КонецОбласти



